# running in veri_fe_taskbmc/src/
read -formal falling_edge_detect.v
prep -top falling_edge_detect
hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
